In [1]:
import pandas as pd

### Rename

#### Renaming Column names

In [5]:
df = pd.DataFrame({'cola': ['a', 'b', 'c', 'd'], 'colb' : [1,2,3, 4], 'colc' : [5,6,7,8]})
df

  cola  colb  colc
0    a     1     5
1    b     2     6
2    c     3     7
3    d     4     8

#### rename() function with columns parameter

In [8]:
df.rename(columns = {'cola' : 'col1', 'colb' : 'col2'})

  col1  col2  colc
0    a     1     5
1    b     2     6
2    c     3     7
3    d     4     8

#### directly use df.columns and give new names

In [15]:
df.columns = ['col1', 'col2', 'col3']
df                                          # but this method will require changing all the col names; you cannot do it partially

  col1  col2  col3
0    a     1     5
1    b     2     6
2    c     3     7
3    d     4     8

#### set_axis() function

In [26]:
df.set_axis(['col_i', 'col_ii', 'col_iii'], axis=1, copy=None)

  col_i  col_ii  col_iii
0     a       1        5
1     b       2        6
2     c       3        7
3     d       4        8

#### Applying functions with rename()

In [27]:
df.rename(columns = str.upper)

  COL1  COL2  COL3
0    a     1     5
1    b     2     6
2    c     3     7
3    d     4     8

#### --------------------------------------------------------------------------------------------------------------------------

### Renaming Indices:

#### rename() function with index parameter

In [28]:
df.rename(index= {0:'i', 1:'ii'})

   col1  col2  col3
i     a     1     5
ii    b     2     6
2     c     3     7
3     d     4     8

#### rename_axis function:
give name to column of indices, rather than the individual labels.

In [30]:
df.rename_axis(index='Row_indices')

            col1  col2  col3
Row_indices
0              a     1     5
1              b     2     6
2              c     3     7
3              d     4     8

### Re-indexing

In [47]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df_new = pd.DataFrame(data, index=[0, 1, 2])
df_new

   A  B
0  1  4
1  2  5
2  3  6

In [50]:
new_index = ['a', 'b', 'c']
df.reindex(new_index)

    A   B
a NaN NaN
b NaN NaN
c NaN NaN

In [37]:
df.reindex(['a', 'b', 'c', 'd', 'e'])

  col1  col2  col3
a  NaN   NaN   NaN
b  NaN   NaN   NaN
c  NaN   NaN   NaN
d  NaN   NaN   NaN
e  NaN   NaN   NaN